Revit 2027 API
DefaultDivideSettings.PathLayout Property
 A default Divided Path layout.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public SpacingRuleLayout PathLayout { get; set; }
Public Property PathLayout As SpacingRuleLayout
	Get
	Set
public:
property SpacingRuleLayout PathLayout {
	SpacingRuleLayout get ();
	void set (SpacingRuleLayout value);
}
member PathLayout : SpacingRuleLayout with get, set
Property Value
SpacingRuleLayout
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
DefaultDivideSettings Class
Autodesk.Revit.DB Namespace